{
    "data" = [ 
        { 
            "id": 1, 		// int， 
            "cno": "1001", 		// 字符串，课程号
            "cname": "web框架编程", 	// 字符串，课程名称 
            "credit": 2.0, 		// float，学分 
            "tname": "张树刚", 	// 字符串，授课教师 
            "assMethod": "考查", 	// 字符串，考核方式：闭卷、考察、其他
            "ctime": "周一7-9节",	// 字符串，上课时间，先这样定义吧，还不知道怎么实现课程表
            "cloc": "信南C202" 	// 字符串，上课地点 
        }, 
        {
            "id": 2, 		
            "cno": "1002", 		
            "cname": "并行与分布式计算", 	
            "credit": 2.5, 		
            "tname": "王志刚", 	
            "assMethod": "考查", 	
            "ctime": "周一7-9节",
            "cloc": "信南C202" 	 
        }

        // 更多课程记录... 
    ]
}
